[
    "At CareerSmarts we teach you how to navigate the many methods of job searching to find the job you want. Do you know there are literally dozens of ways to locate, apply for and find positions today? Many of them are often missed or forgotten, meaning you are missing opportunities for employment that you do not even know about. Without our assistance, you may never know about 80% (or more) of the jobs and positions available today because they are never posted.",
    "Our professional Career Coaches explain how to apply for the position with a refined resume and cover letter, written and designed to get through online filters and mechanical sorting methods that often eliminate your submission before anyone even sees it. We help you understand how to properly write the body of your resume so it achieves both getting to the decision-maker and getting you the interview, ahead of the thousands of other submissions.",
    "Our expert Career Coaching and Career Counseling help you develop a systematic approach that allows you to write a unique cover letter for each position you are applying for. If you are using a generic letter, you will not be successful. A properly designed cover letter must be specifically created to reach the person it is intended for AND achieve your goal of gaining the interview. Often the cover letter can be the single most important piece in getting you through to the interview.",
    "CareerSmarts Job Search Coaches are experts in preparing you for the interview. Preparation is the key to getting a call back. We provide everything you need to know so that you are fully prepared for the critical first step which is usually a phone interview. This will open the door to the all-important face to face interview with the person who will make the decision. Knowing what to expect in these interviews and being ready with the appropriate answers is imperative to achieving your next interview or receiving a job offer. Lack of preparation and not knowing exactly what to expect could cost you opportunities.",
    "The goal of our Career Development Facilitator is to help you identify and realize your career and employment goals. We will create and implement a personal career strategy which can best position you to achieve career success in today's complicated and sophisticated job market.",
    "CareerSmarts professional job placement advice gives your job search much needed structure and arms you with the job search information you need to land the employment position you want.",
    "With our expert career counseling service we hope you will identify your strengths and develop the confidence to articulate what you have to offer an employer. We will increase your belief in yourself and your motivation to achieve your career goals.",
    "We've helped hundreds of clients who have been where you are, and we know what it takes to get you back on track and keep you there until you reach your goal!",
    "CareerSmarts welcomes you with a no obligation discussion with a Professional Career Coach to identify your personal career needs.",
    "CareerSmarts is a 'cost-effective' career counseling service where you get the resources and support you need to reach your career goal in the shortest amount of time.",
    "You can choose to receive expert advice in all facets of your career/job search or pick specific areas of our program that best suit your needs and budget.",
    "Our skills, experience, and knowledge of the marketplace will direct and support your career campaign.",
    "Our commitment is to your success."
]