{
    "name": "Lionel Desjardins",
    "credentials": "BA, BEd, MA, MEd",
    "linkedIn": "https://www.linkedin.com/in/lionel-desjardins-6a975a1a",
    "paragraphs": [
        "Lionel has, for over twenty years, managed and motivated teams as large as 120 in various public and private sector environments. He has successfully supervised educational institutions through periods of unprecedented change while maintaining positive and productive environments. He has implemented training programs for service professionals based on thorough growth oriented and positive performance appraisals.",
        "Lionel has successfully provided Outplacement, Executive Career Coaching and Management Consulting services to individuals and groups based on solid testing and thorough research. His success in this role requires an accurate assessment of skills, knowledge and personality as they predispose to action in the workplace. His ability to teach and motivate prepares his clients to improve not only their performance but also the performance of those around them.",
        "Lionel has worked with clients including professionals from all major sectors ranging from automotive manufacturing through pharmaceutical and all forms of financial and government services including NGO non profit organizations and Retail management. He knows what fosters success and what leads to failure. These insights enable him to successfully coach clients to improve performance and to develop a solid career path. He has designed and implemented career initiation programs for new college and university graduates, which continue to foster success. His workshops and presentations related to career coaching and fostering positive change have met with rave reviews.",
        "He holds Masters Degrees from both The University of Western Ontario and The University of Ottawa which enhance his knowledge of Leadership Theory and Human Resource management. He also holds a Global Career Development Facilitator credential from the NCDA and the FACET 5 Certification."
    ]
}