[
    "Lionel, I can't thank you enough for your words of enc*ouragement and advi*ce.  Your coaching and support made all the difference.  The value prop sheet you put together for me was what caught their eye and like you said - they were almost salivating to get me to come over to their side.  The words 'what can we do to convince you' actually came out of the hiring manager's mouth.  Unbelievable. You are awesome.",
    "Lionel, I just had an interview for this job.....went very well....the recruiter was extremely impressed with the cover letter and resume format.  She said she has been a recruiter for a long time and loved the format, has never seen it!  Thanks for that!",
    "Thanks so much Lionel for all you have done for me. You have given me the courage to speak up and negotiate my pay and perks. I figure I am getting about an extra $12,000.00 per year.",
    "Lionel, our practice interview sessions really improved my confidence. My presentation was bang on. I was well organized, confident and able to convey the information with ease to the interview panel. I am confident that I have achieved my goal.",
    "I came to CareerSmarts because I felt that my qualifications were not reflected in the job that I had. I would apply for jobs without ever hearing a response back. After 10 weeks of working with Lionel, I have had many job offers, including a position at three times my previous salary! I now feel more confident about my potential and I am able to consider a variety of options!",
    "Lionel Desjardins ended up being more of a shrink than a career counselor. I can't say enough positive about how much Lionel helped me... I often referred to him as Tony Robbins on steroids... He NEVER gave up on me. He helped me prepare for every interview and got me to focus on what were realistic expectations.",
    "It's hard to be 'brief' when it comes to Lionel! I met Lionel in 2006 and he became my career coach (before he opened CareerSmarts). Lionel's strengths are helping a person look at ALL of their experiences and talents and how to use them to advance their career. More importantly, he helped me really discover what I do best and encouraged me to focus on it. He was very patient and encouraging throughout this process, and I have to say that his coaching exceeded my expectations. I would have no hesitation recommending Lionel to anyone who is looking to discover the same in themselves.",
    "Lionel is a very good listener. He helped me to understand what I needed to do to get my career in order. He was very patient in helping me to reorganize my resume and my career goal ambitions. Lionel's enthusiastic personality is infectious and gives the client the added motivation to succeed in their job search. With Lionel's support, I'm now looking forward to my new career in the communications industry.",
    "Just wanted to let you know how everything with the new job is going. The company is amazing! Fantastic support and the training program has been phenomenal! The people I work with are great, my manager is awesome, and I'm having excellent calls with my new customers! I haven't met them all yet...still making my way across the territory. Everything is unbelievable. Just finished the sales period for a very important national trade show and I received very impressive feedback about my results.",
    "Lionel I recall the people that have made a tremendous impact on my recovery and I am proud to count you in that group. You may never know much you helped me.",
    "The practice interview with Lionel was very helpful to me to have an objective individual take me through the paces of an interview and provide valuable feedback and suggestions for improvement.",
    "I wish to thank you for your help and guidance over the past few months. You helped me to remember who I am, how much I have to offer and how best to present myself. Above all, you helped me to open the door to where I had hidden my confidence. Thank you so much!",
    "I just wanted to officially thank-you for helping me with my interview. I found that your tips and advice really helped me the day of the interview and I also felt a lot more confident after practicing with you. I got an offer for the job so I am really excited!",
    "I Want to THANK YOU for all your help in getting my head straight and pointed in right direction.",
    "Hi Lionel, Sorry for taking so much time to touch base with you. The last 3 weeks have been very busy training for my new job. I am now flying on my own! The job is very interesting and although the marketing plan is already set for the coming year, there will still be room for initiative.",
    "Things are going amazingly well and I wanted to thank you for all your help and support in the past. This job was like it was dropped from heaven.",
    "You've been instrumental in my achievements both through personal motivation and in giving me the opportunity to talk about things that I would normally have to keep bottled inside.",
    "Things are going well and everyday is a learning experience. I am enjoying the new position and feel it will be a good fit for me.",
    "Just a quick email as confirmation of my new job. Again, THANK YOU so much, the new resume was what sold them on the higher dollars, and the negotiating skills were what made that amount even higher. I have made a major step in my career that I could almost not even imagine a year ago. Now it's a reality, and I'm loving it."
]